auto = "Автозаправочные станции Автозапчасти Автостоянки Автофургоны - продажа, производство Аджастер-услуги Водительские медкомиссии ГАИ Продажа автомобилей и запасных частей к ним Производство автомобилей и запасных частей Сертификация запасных частей к автомобилям Техобслуживание Эвакуация, буксировка, перегон автомобилей"
administration = "Архивы Воинские части Государственные комитеты Государственный кадастр Женские общественные организации ЗАГСы Защита прав потребителей Инспекции Коммунальные службы Махаллинские комитеты Межправительственные организации, соглашения, проекты Министерства и ведомства Налоговые органы ОВВиОГ, ГУВД, РОВД Органы управления республики Каракалпакстан, областей и г.Ташкента Органы хозяйственного управления Республиканские органы управления Социальное обеспечение Социологические исследования Транспортные услуги - органы управления Участковые пункты милиции Хокимияты"
business = "Аккредитация представительств - услуги Акции - услуги по ведению реестра акционеров Аттестация персонала по охране труда - услуги Аттестация рабочих мест - услуги Аутстаффинг - услуги Бизнес-планы, тэо - разработка Бизнес-фонды Бухгалтерские услуги Выставки Инжиниринг - услуги Инновационная деятельность Коворкинг центры Консалтинговые услуги Курьерские услуги Лицензирование - услуги Полиграфия Предметы интерьера и декора Представительства зарубежных компаний Проектный менеджмент Реклама Статистические и маркетинговые исследования, консалтинг Страхование Таможенные услуги Трудоустройство Экологическое проектирование Экспортно-импортные операции"
texnika = "Бытовая техника - продажа, ремонт Водонагреватели электрические и газовые Газовая плита Газовые, электрические плиты - производство, продажа Кондиционеры бытовые Лампы электрические Нагревательные приборы Продажа бытовой техники Производство бытовой техники Ремонт бытовой техники Светильники электрические - производство, продажа Телевизоры Товары в кредит Фильтры бытовые Холодильники Электронагревательные приборы Электротовары - производство, продажа"
diplomatics = "Генеральные и Почетные Консульства Посольства Представительства международных организаций Представительства международных финансовых организаций Торговые представительства с дипломатическим статусом"
it = "IT-технологии Id-карты - изготовление, продажа Автоматизация систем управления Государственные организации ИТ-консалтинг Иностранные компании Интернет-коммерция Интернет-услуги Компьютеры и оргтехника - продажа, ремонт Магазины Мобильная связь Оборудование для полиграфии и рекламы Обучение Партнеры, дилеры и дистрибьюторы мировых производителей Поставка и монтаж телекоммуникационного и сетевого оборудования Поставка компьютеров, комплектующих, оргтехники Поставка компьютеров, комплектующих, оргтехники Поставка расходных материалов Представительства Разработка и поставка ПО Ремонт и обслуживание компьютеров, оргтехники Системная интеграция Системы безопасности Средства связи Электронные пропуска - изготовление"
kommunal = "Благоустройство и озеленение Водоснабжение и канализация Вывоз и утилизация бытовых отходов Газоснабжение Коммунальные эксплуатационные услуги Теплоснабжение Управляющие компании Установка и сервисное обслуживание счетчиков Эксплуатация зданий Энергоснабжение"
iskusstvo = "Антиквариат - оценка, продажа, скупка, реставрация Библиотеки Дворцы и дома культуры Декоративно-прикладное искусство Искусство - оценка, продажа произведений Кино-, видео- и аудиопродукция Кинотеатры, театры, музеи Кинотеатры Концертные организации и коллективы Культурные центры Музеи Пленка для кино-фотосъемки Религия Свадебные салоны Скульптура и монументальное искусство Театры Учреждения культуры Школы танцев"
mebel = "Гостиная мебель Детская мебель Корпусная мебель Кухонная мебель Матрасы Мебель для дома Мебель для офиса Мебель для прихожей Мебель для спальни Мебель для учебных заведений Мебель из металла Мебель из ротанга Мебель из стекла Мебель на заказ Мебельная фурнитура Медицинская мебель Мешки биг бэг Пластмассовая мебель Ремонт мебели Столы биллиардные Шкафы-купе"
medicina = "Аптеки Ветеринария Государственные органы управления медициной Демонтаж и утилизация медицинского оборудования Диагностические центры Клинические больницы и клиники Красота и здоровье Лаборатории Лекарственные и эфирномасличные растения и культуры Мать и дитя Медицинская одежда Медицинские печатные издания Медицинские центры, лечебные и диагностические амбулатории Медицинский туризм Медицинское оборудование Оборудование для утилизации медицинских отходов Образовательные и научные медицинские учреждения Ортопедическая обувь - производство, продажа Поликлиники Санитарно-эпидемиологические службы Стационарное лечение Фарм. организации Фармацевтическое оборудование и инструментарий Фитобары Частные клиники"
nauka = "Аэрофотосъемка Геодезическая служба Геофизика Гидрометеорология Другие организации по обслуживанию научных учреждений Конструкторские бюро Конструкторские, проектные и изыскательские организации Космические исследования Надзор и контроль за стандартами и средствами измерений в промышленности Научно-техническая документация - разработка, внедрение Научные учреждения академического профиля Научные учреждения отраслевого профиля Научные, научно-производственные организации Подготовка кадров с высшим образованием Поиски и разведка месторождений твердых полезных ископаемых и подземных вод Сейсмология Технические испытания и исследования Топографо-геодезические изыскания Учреждения по охране природы, ведущие научную работу"
nedvijimost = "Агентства недвижимости (риэлторы) Аренда недвижимости Аренда помещений Аренда складов Застройщики (Девелоперы) Квартиры в кредит Новостройки Оценка недвижимости Покупка недвижимости Приватизация - консультации, услуги"
oborudovaniye = "Асфальто-бетонное оборудование Аттракционы - производство, продажа Газовое оборудование Демонтаж и утилизация оборудования Деревообрабатывающее оборудование Механическое оборудование - производство, продажа Нестандартное оборудование Нефтегазовое и горнодобывающее оборудование Оборудование - производство, продажа Оборудование - ремонт Оборудование безопасности Оборудование для коммунального хозяйства Оборудование для пищевой и комбикормовой промышленности Оборудование для предприятий торговли и общественного питания Оборудование для учебных заведений Оборудование для химической промышленности Оборудование для хлопкоперерабатывающей отрасли Оборудование прочее Полиграфическое оборудование Прессовое оборудование Санитарно-техническое оборудование и изделия Текстильное оборудование Химическое оборудование - ремонт, монтаж Эксплуатационные материалы и запчасти"
obrazovaniye = "Образование за рубежом Образовательные учреждения Учебные центры"
obshestvennaya = "Вневедомственная охрана Отделы по делам обороны Пожарная безопасность"
obyedineniya = "Кредитные союзы Молодежные общественные объединения Общественные объединения по сферам коммерческой деятельности Объединения социальной защиты и общества инвалидов Политические объединения Потребительская кооперация Профсоюзы Творческие, научно-технические и культурно-просветительские, общественные объединения Физкультурно-спортивные общественные объединения Экологические организации"
otdih = "Авиакассы Азартные игры, лотереи Аквапарки, бассейны, сауны Аттракционы Бильярд Боулинг, бильярд Боулинг Гольф Гостиницы Дискотеки и танцевальные залы Игровые комплексы, залы Интернет-кафе Концертные залы и студии Ледовые катки Парки культуры и отдыха Пейнтбол Развлекательные центры Развлечения Санаторно-курортные учреждения Туризм Цирки Шоу-бизнес"
prom = "Добыча и переработка полезных ископаемых Заводы, фабрики, цеха Легкая промышленность Машиностроение Оборудование технологическое Пищевая промышленность Приборостроение Производство строительных материалов и оборудования Промышленная безопасность Ремонт Тяжелая промышленность Химическая промышленность Швейное производство Энергетика"
resta_cafe = "Fast-Food, пиццерии Банкетные залы Бары Все для ресторанов Караоке-бары Клубы Кондитерские Кофейни Организации общественного питания Пабы Рестораны и бары - оборудование Рестораны Чайхана"
smi = "Газеты, журналы - распространение Информационно-справочные системы - право Подписка и распространение периодических изданий Редакции и издательства Редакции телевидения и радиовещания Телевидение цифровое, спутниковое Телевидение"
selskoye = "Агрохимия Другие организации по обслуживанию сельского хозяйства Животноводство Защита растений и карантин Зерно - переработка, производство, закупка, продажа Каракуль - производство, обработка, продажа Кенаф-волокно - производство, обработка Корма для животных и птиц, комбикорма Лесная промышленность Лесопарковые хозяйства Мелиорация, орошение земель Растениеводство Рис, рисоводство Садовые питомники Сельскохозяйственная продукция - производство, заготовка, переработка Сельскохозяйственная техника, оборудование, запчасти Сухофрукты - заготовка, реализация Хлопкозаводы - пуско-наладка, ремонт, монтаж оборудования Хлопок - линт Хлопок - переработка, реализация, закупка Шерсть - заготовка, реализация Эксплуатация ирригационных и мелиоративных систем Экспорт плодоовощной продукции Экспорт сухофруктов"
snabjeniye = "Заготовительные организации Материально-техническое снабжение парков и зрелищных мероприятий Материально-техническое снабжение Складирование Хозяйственное управление материально-техническим снабжением"
remont = "Архитектурное проектирование и дизайн Бассейны и сауны - оборудование Бетон и растворы Гидроизоляционные материалы Двери и перегородки - производство и продажа Двери и перегородки - производство и продажа Жалюзи - производство и продажа Железо-бетонные конструкции (ЖБИ) Изделия из камня Инвентаризация техническая строений и сооружений Инструменты Интерактивное оборудование Камины - производство, дизайн и установка Канцелярские товары Кирпич - продажа и производство Кровельные материалы Лакокрасочная продукция Лесопиломатериалы Лестницы - установка и изготовление Металлоконструкции - производство и установка Металлопрокат Научно-исследовательские организации Окна - изготовление и установка Осветительные приборы Отделочные материалы Пленка и поролон Поликарбонатные сотовые плиты Полы и напольные покрытия Поставка оборудования и сырья Потолки Природные материалы Продажа строительных материалов Резинотехническая продукция Сантехника - производство и продажа Системы безопасности и охраны Солнцезащитные автоматические системы Спецодежда - производство и продажа Спортивные напольные покрытия Стекло и стеклоизделия Строительные базары Строительные компании Строительные материалы Строительство заводов Строительство и ремонт Сухие строительные смеси Счетчики Сэндвич-панели Тара, ёмкости, упаковка Тепло- и звукоизоляция Техника и оборудование Трубы Услуги Учебные заведения строительного профиля Химическая продукция Цемент - производство и продажа Швеллер - продажа, производство"
svyaz = "Call-центры АТС Атс - бюро ремонта Кабельное телевидение Курьерская связь Междугородная, международная телефонная связь Почтовые отделения, почтовые услуги Связь - транковая (подвижная наземная радиосвязь) Связь пейджинговая Сотовая связь Таксофоны Телеграфные и телефонные станции Телекоммуникационное оборудование Телекоммуникационные услуги Учреждения телекоммуникации и связи"
tovary = "Бытовая химия и моющие средства Домашний текстиль Ковровые изделия Комнатные растения, срезанные цветы Кофе - производство, продажа Одежда и обувь - продажа, пошив Прокат карнавальных костюмов"
torgovlya = "Внешняя торговля негосударственных организаций Государственная внешняя торговля Магазины - фирменные Операции с недвижимым имуществом Оптовая торговля Посреднические услуги при купле-продаже и сдаче в наем (в аренду) жилья и другого недвижимого имущества непроизводственного назначения Посреднические услуги при купле-продаже и сдаче в наем (в аренду) недвижимого имущества производственного назначения Посреднические услуги при купле-продаже товаров народного потребления Посреднические услуги при купле-продаже товаров, ценных бумаг, валюты и сдача в наем (в аренду, в прокат) без выраженной специализации Продажа автомобилей и комплектующих Продажа и сдача в наем (в аренду) недвижимого имущества непроизводственного назначения Продажа и сдача в наем (в аренду) недвижимого имущества производственно-технического назначения Розничная торговля Сдача в наем (в аренду) оборудования и машин производственно-технического назначения Товары для детей Товары народного потребления - продажа Торгово-промышленные палаты Химические реактивы и лабораторное оборудование"
transport = "Авиабилеты Авиационный транспорт Автобазы, автокомбинаты Автомобили, автозапчасти, автохимия Автомобильное хозяйство Автосервис, автомойки, АЗС Автосервисы Бронирование и продажа билетов Грузовые автомобили и спецтехника Грузоперевозка и другие транспортно-экспедиционные услуги Железнодорожный транспорт Логистические компании Международные грузоперевозки Метрополитенный транспорт общего пользования Мотоциклы - продажа, производство Проездные карточки Транспортные перевозки Троллейбусы - производство, продажа Троллейбусы Управление и обслуживание транспорта Шоссейное хозяйство Экологический контроль автотранспорта"
uslugi = "Аварийные и справочные службы, службы первой помощи Адвокатские услуги Аудио-, видеотехника - ремонт Аэрография Бани, сауны Брачные агентства Бытовые услуги - нормативная документация (разработка, проектирование) Дезинсекция, дератизация Заказ такси Золотое шитье Изготовление и ремонт ювелирных изделий Индивидуальный пошив обуви Индивидуальный пошив одежды Клининговые услуги Контрольные приборы и автоматика - ремонт Ксерокопия, переплёт, ламинация Няни, гувернантки, домработницы, сиделки Оптические средства измерения - ремонт Организации сферы услуг Организация и оформление торжеств Охрана - услуги Памятники - изготовление, охрана, реставрация Прачечные Приём платежей Прокат и продажа свадебных, вечерних платьев и аксессуаров Прокат хозяйственных товаров Прокат, аренда автотранспорта Пункты подключения и приема оплаты за услуги сотовой связи Регенерация кинескопов Ремонт кожевенно-галантерейных изделий Ремонт компьютеров, сотовых телефонов, фотоаппаратов Ремонт часов Ритуальные услуги Салоны красоты Сейфы, замки - вскрытие, ремонт Текстильный дизайн интерьера Товары и услуги Удаление татуировок Услуги прочие Услуги сантехников, электриков Фото и видеоуслуги Химчистки Цветы, подарки - доставка Чрезвычайные ситуации - исследования, предупреждение, ликвидация последствий"
sport = "Бассейны Оздоровительные учреждения Спортивные комплексы и стадионы Спортивные комплексы, фитнес, солярий, массаж Спортивные учреждения Спортивные федерации Спорттовары Управления и отделы по делам культуры и спорта"
finance = "Аудиторские услуги Банки Банковское оборудование Биржевая деятельность Депозитарии Дисконт-организации Инвестиционная деятельность Кредиты на образование Лизинговые услуги Ломбарды Микрофинансовые организации Пластиковые карты - разработка, изготовление Представительства зарубежных банков Регистрация предприятий Системы электронных платежей Финансовые организации Финансовый лизинг Ценные бумаги"
jure = "Защита гражданская Недвижимость и оценка имущества Нотариальные конторы Патентные услуги, защита авторских прав Переводы и легализация документов Прокуратуры Судебно-медицинская экспертиза Судебные департаменты Суды Услуги адвокатов Услуги по оформлению грузовых таможенных деклараций"



import csv

# Список сфер деятельности
spheres = [
    auto,
    administration,
    business,
    texnika,
    diplomatics,
    it,
    kommunal,
    iskusstvo,
    mebel,
    medicina,
    nauka,
    nedvijimost,
    oborudovaniye,
    obrazovaniye,
    obshestvennaya,
    obyedineniya,
    otdih,
    prom,
    resta_cafe,
    smi,
    selskoye,
    snabjeniye,
    remont,
    svyaz,
    tovary,
    torgovlya,
    transport,
    uslugi,
    sport,
    finance,
    jure,
]

change_list = [
    "Автомобили",
    "Административные учреждения",
    "Бизнес услуги",
    "Бытовая техника",
    "Дипломатический корпус",
    "ИТ-рынок",
    "Коммунальные услуги",
    "Культура и искусство",
    "Мебель",
    "Медицина",
    "Научные учреждения",
    "Недвижимость",
    "Оборудование",
    "Образование",
    "Общественная безопасность",
    "Общественные объединения",
    "Отдых и развлечения",
    "Промышленность",
    "Рестораны и кафе",
    "СМИ",
    "Сельское хозяйство",
    "Снабжение",
    "Строительство и ремонт",
    "Телекоммуникация и связь",
    "Товары",
    "Торговля",
    "Транспорт",
    "Услуги населению",
    "Физическая культура и спорт",
    "Финансы",
    "Юридические услуги"
]

# Создаем словарь, сопоставляющий сферы деятельности из списка spheres с соответствующими значениями из списка change_list
sphere_map = {
    spheres[i]: change_list[i] for i in range(len(spheres))
}

# Открываем файл для чтения
with open('../data/output.csv', 'r', newline='') as f:
    reader = csv.reader(f, delimiter=',')

    # Создаем новый файл для записи
    with open('../data/changedcsv.csv', 'w', newline='') as fw:
        writer = csv.writer(fw, delimiter=',')

        # Проходим по строкам файла
        for row in reader:
            # Получаем название компании
            company_name = row[0]

            # Получаем список сфер деятельности
            spheres_list = row[1].split(', ')

            # Обходим список сфер деятельности, заменяя их на соответствующие значения из словаря
            for i, sphere in enumerate(spheres_list):
                if sphere in sphere_map:
                    spheres_list[i] = sphere_map[sphere]

            # Заменяем список сфер деятельности на новую строку
            row[1] = ', '.join(spheres_list)

            # Записываем строку в новый файл
            writer.writerow(row)

